<template>
  <sui-page class="custom_page">
    <sui-page-header :page-id="this.$options.name" />
    <sui-page-contents>
      <ur-tab-box
        default-idx="1"
        class="mt35"
      >
        <ur-tab-content
          idx="1"
          label="에버랜드"
        >
          <!-- 일별 시설 운영 통계 제목 -->
          <div class="comm_btn_wrap mt45">
            <div class="left_box">
              <div class="comm_title_wrap">
                <h4>
                  일별 시설 운영 통계
                </h4>
              </div>
            </div>
            <div class="right_box">
              <span class="subscript_txt mr16 ">
                *엑셀다운로드 시 전체 데이터가 하나의 엑셀로 다운로드 됩니다.
              </span>
              <ur-button>
                <ur-icon
                  icon="download"
                  icon-type="line"
                  size="small"
                  spacing
                />
                엑셀다운로드
              </ur-button>
            </div>
          </div>

          <!-- 일별 시설 운영 통계 Table-->
          <ur-data-grid
            id="fgrid-sample9-1"
            ref="grid"
            :headers="columns01"
            :data-source="list01"
            :data-set-options="{id: 'id'}"
            :options="opts1"
            class="custom_grid_pgeNav_None"
          />

          <!-- 일별 시설 운영 정보 제목-->
          <div class="comm_btn_wrap mt45">
            <div class="left_box">
              <div class="comm_title_wrap">
                <h4>
                  일별 시설 운영 정보
                </h4>
              </div>
            </div>
          </div>

          <!-- 일별 시설 운영 정보 Table-->
          <table class="date_table mb45">
            <!-- ********** 테이블 구조 파악 : tr 태그를 기준으로 접어서 구조 파악하기 권장 드립니다. **********-->

            <!-- S :: 일별 시설 운영 정보 테이블 헤더 영역-->
            <thead>
              <!-- 테이블 제목 1행 (요일,날짜)-->
              <tr>
                <!-- rowspan = "2" : 세로로 2칸 셀 병합 (테이블 목록 분류 : 시설명)-->
                <th rowspan="2">
                  시설명
                </th>
                <th><span class="day">일</span> <span class="date">11.20</span></th>
                <th><span class="day">월</span> <span class="date">11.21</span></th>
                <th><span class="day">화</span> <span class="date">11.22</span></th>
                <th><span class="day">수</span> <span class="date">11.23</span></th>
                <th><span class="day">목</span> <span class="date">11.24</span></th>
                <th><span class="day">금</span> <span class="date">11.25</span></th>
                <th><span class="day">토</span> <span class="date">11.26</span></th>
              </tr>

              <!-- 테이블 제목 2행 (시간)-->
              <tr>
                <th><span class="start">10 : 00</span> ~ <span class="end">21 : 00</span></th>
                <th><span class="start">10 : 00</span> ~ <span class="end">21 : 00</span></th>
                <th><span class="start">10 : 00</span> ~ <span class="end">21 : 00</span></th>
                <th><span class="start">10 : 00</span> ~ <span class="end">21 : 00</span></th>
                <th><span class="start">10 : 00</span> ~ <span class="end">21 : 00</span></th>
                <th><span class="start">10 : 00</span> ~ <span class="end">21 : 00</span></th>
                <th><span class="start">10 : 00</span> ~ <span class="end">21 : 00</span></th>
              </tr>
            </thead>
            <!-- E :: 일별 시설 운영 정보 테이블 헤더 영역-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 01 (tbody 태그 이용하여 굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- 챔피온쉽 로데오 -->
              <tr>
                <th>챔피온쉽 로데오</th> <!-- 시설명 : 챔피온쉽 로데오-->
                <td /> <!-- 챔피온쉽 로데오 일 11.20 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 챔피온쉽 로데오 월 11.21 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 챔피온쉽 로데오 화 11.22 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 챔피온쉽 로데오 수 11.23 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 챔피온쉽 로데오 목 11.24 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 챔피온쉽 로데오 금 11.25 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 챔피온쉽 로데오 토 11.26 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
              </tr>

              <!-- 로봇 VR -->
              <tr>
                <th>로봇 VR</th> <!-- 시설명 : 로봇 VR-->
                <!-- colspan="7" : 로봇 VR 일,월,화,수,목,금 10:00 ~ 21 : 00 셀 영역 7개 병합 ([운휴])-->
                <td colspan="7">
                  <div class="bg-purple">
                    <div>[운휴]</div> <!-- 로봇 VR 병합한 셀의 내용-->
                  </div>
                </td>
              </tr>

              <!-- 자이로 VR -->
              <tr>
                <th>자이로 VR</th> <!-- 시설명 : 자이로 VR -->
                <!-- colspan="7" : 자이로 VR 일,월,화,수,목,금 10:00 ~ 21 : 00 셀 영역 병합 ([운휴])-->
                <td colspan="7">
                  <div class="bg-purple">
                    <div>[운휴]</div> <!-- 자이로 VR 병합한 셀의 내용-->
                  </div>
                </td>
              </tr>

              <!-- 아마존 익스프레스 -->
              <tr>
                <th>아마존 익스프레스</th> <!-- 시설명 : 아마존익스프레스 -->
                <td /> <!-- 아마존익스프레스 일 11.20 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 아마존익스프레스 월 11.21 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 아마존익스프레스 화 11.22 10 : 00 ~ 21 :00 셀 영역(빈칸) -->

                <!-- colspan="4" : 아마존익스프레스 11.22 ~ 11.26 까지의 셀 영역 병합 (PM 점검) -->
                <td colspan="4">
                  <div class="bg-purple">
                    <div>[PM 점검]</div> <!-- 아마존익스프레스 병합한 셀의 내용-->
                  </div>
                </td>
              </tr>

              <!-- 콜럼버스대탐험 -->
              <tr>
                <th>콜럼버스대탐험</th> <!-- 시설명 : 콜럼버스대탐험 -->
                <td /> <!-- 콜럼버스대탐험 일 11.20 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 콜럼버스대탐험 월 11.21 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 콜럼버스대탐험 화 11.22 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 콜럼버스대탐험 수 11.23 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 콜럼버스대탐험 목 11.24 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 콜럼버스대탐험 금 11.25 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 콜럼버스대탐험 토 11.26 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
              </tr>

              <!-- 더블락스핀 -->
              <tr>
                <th>더블락스핀</th> <!-- 시설명 : 더블락스핀 -->
                <td /> <!-- 더블락스핀 일 11.20 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 더블락스핀 월 11.21 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 더블락스핀 화 11.22 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 더블락스핀 수 11.23 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 더블락스핀 목 11.24 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 더블락스핀 금 11.25 10 : 00 ~ 21 :00 셀 영역(빈칸) -->

                <!-- 더블락스핀 토 11.20 10 : 00 ~ 21 :00 셀 영역([오전 점검] 13:00 ~) -->
                <td>
                  <div class="bg-purple">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>
              </tr>

              <!-- 렛츠트위스트 -->
              <tr>
                <th>렛츠트위스트</th>
                <td /> <!-- 렛츠트위스트 일 11.20 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 렛츠트위스트 월 11.21 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 렛츠트위스트 화 11.22 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 렛츠트위스트 수 11.23 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 렛츠트위스트 목 11.24 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 렛츠트위스트 금 11.25 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 렛츠트위스트 토 11.26 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
              </tr>

              <!-- 롤링X트레인 -->
              <tr>
                <th>롤링X트레인</th>
                <td /> <!-- 롤링X트레인 일 11.20 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 롤링X트레인 월 11.21 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 롤링X트레인 화 11.22 10 : 00 ~ 21 :00 셀 영역(빈칸) -->
                <td /> <!-- 롤링X트레인 수 11.23 10 : 00 ~ 21 :00 셀 영역(빈칸) -->

                <!-- 롤링X트레인 목 11.24 10 : 00 ~ 21 :00 셀 영역([오전 점검] 13:00 ~) -->
                <td>
                  <div class="bg-purple">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>

                <td /> <!-- 롤링X트레인 셀 영역 금 11.25 10 : 00 ~ 21 : 00 셀 영역(빈칸) -->
                <td /> <!-- 롤링X트레인 셀 영역 토 11.26 10 : 00 ~ 21 : 00 셀 영역(빈칸) -->
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 01 (굵은 선 기준으로 나눔)-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 02 (굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- 릴리댄스-->
              <tr>
                <th>릴리댄스</th> <!-- 시설명 : 릴리댄스 -->
                <td /> <!-- 릴리댄스 1번째 셀 영역 (빈칸) -->
                <td /> <!-- 릴리댄스 2번째 셀 영역 (빈칸) -->
                <td /> <!-- 릴리댄스 3번째 셀 영역 (빈칸) -->
                <td /> <!-- 릴리댄스 4번째 셀 영역 (빈칸) -->
                <td /> <!-- 릴리댄스 5번째 셀 영역 (빈칸) -->

                <!-- 릴리댄스 6번째 셀 영역 ([오전 점검] 13:00 ~) -->
                <td>
                  <div class="bg-primary-01">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>

                <td /> <!-- 릴리댄스 7번째 셀 영역-->
              </tr>

              <!-- 레이싱코스터-->
              <tr>
                <th>레이싱코스터</th> <!-- 시설명 : 레이싱코스터 -->
                <td /> <!-- 레이싱코스터 1번째 셀 영역 (빈칸) -->
                <td /> <!-- 레이싱코스터 2번째 셀 영역 (빈칸) -->
                <td /> <!-- 레이싱코스터 3번째 셀 영역 (빈칸) -->
                <td /> <!-- 레이싱코스터 4번째 셀 영역 (빈칸) -->

                <!-- 레이싱코스터 5번째 셀 영역 ([오전 점검] 13:00 ~) -->
                <td>
                  <div class="bg-primary-01">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>

                <td /> <!-- 레이싱코스터 6번째 셀 영역 (빈칸) -->
                <td /> <!-- 레이싱코스터 7번째 셀 영역 (빈칸) -->
              </tr>

              <!-- 볼하우스 -->
              <tr>
                <th>볼하우스</th> <!-- 시설명 : 볼하우스 -->

                <!-- 볼하우스 1,2,3,4,5,6,7번째 병합한 셀 영역 ([운휴]) -->
                <td
                  colspan="7"
                >
                  <div class="bg-primary-01">
                    <div>[운휴]</div>
                  </div>
                </td>
              </tr>

              <!-- 플라잉레스큐 -->
              <tr>
                <th>플라잉레스큐</th> <!-- 시설명 : 플라잉레스큐 -->
                <td /> <!-- 플라잉레스큐 1번째 셀 영역 (빈칸) -->
                <td /> <!-- 플라잉레스큐 2번째 셀 영역 (빈칸) -->
                <td /> <!-- 플라잉레스큐 3번째 셀 영역 (빈칸) -->

                <!-- 플라잉레스큐 4번째 셀 영역 (빈칸) -->
                <td>
                  <div class="bg-primary-01">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>
                <td /> <!-- 플라잉레스큐 5번째 셀 영역 (빈칸) -->
                <td /> <!-- 플라잉레스큐 6번째 셀 영역 (빈칸) -->
                <td /> <!-- 플라잉레스큐 7번째 셀 영역 (빈칸) -->
              </tr>

              <!-- 플레이야드 -->
              <tr>
                <th>플레이야드</th> <!-- 시설명 : 플레이야드 -->

                <!-- 플레이야드 1,2,3,4,5,6,7번째 병합한 셀 영역 ([B조 오픈] 12:00 ~ 17:00) -->
                <td
                  colspan="7"
                >
                  <div class="bg-primary-01">
                    <div>[B조 오픈] 12:00 ~ 17:00</div>
                  </div>
                </td>
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 02 (굵은 선 기준으로 나눔)-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 03 (굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- 자동차왕국 -->
              <tr>
                <th>자동차왕국</th> <!-- 시설명 : 자동차왕국 -->
                <td /> <!-- 자동차왕국 1번째 셀 영역 (빈칸) -->

                <!-- 자동차왕국 2,3,4번째 셀 영역 ([일부 변경] 10:00 ~ 20:00) -->
                <td
                  colspan="3"
                >
                  <div class="bg-warning">
                    <div>[일부 변경] 10:00 ~ 20:00</div>
                  </div>
                </td>

                <td /> <!-- 자동차왕국 5번째 셀 영역 (빈칸) -->
                <td /> <!-- 자동차왕국 6번째 셀 영역 (빈칸) -->
                <td /> <!-- 자동차왕국 7번째 셀 영역 (빈칸) -->
              </tr>

              <!-- 시크릿쥬쥬비행기 -->
              <tr>
                <th>시크릿쥬쥬비행기</th> <!-- 시설명 : 시크릿쥬쥬비행기 -->
                <td /> <!-- 시크릿쥬쥬비행기 1번째 셀 영역 (빈칸) -->
                <td /> <!-- 시크릿쥬쥬비행기 2번째 셀 영역 (빈칸) -->
                <td /> <!-- 시크릿쥬쥬비행기 3번째 셀 영역 (빈칸) -->
                <td /> <!-- 시크릿쥬쥬비행기 4번째 셀 영역 (빈칸) -->
                <td /> <!-- 시크릿쥬쥬비행기 5번째 셀 영역 (빈칸) -->
                <td /> <!-- 시크릿쥬쥬비행기 6번째 셀 영역 (빈칸) -->
                <td /> <!-- 시크릿쥬쥬비행기 7번째 셀 영역 (빈칸) -->
              </tr>

              <!-- 우주전투기 -->
              <tr>
                <th>우주전투기</th> <!-- 시설명 : 우주전투기 -->
                <td /> <!-- 우주전투기 1번째 셀 영역 (빈칸) -->
                <td /> <!-- 우주전투기 2번째 셀 영역 (빈칸) -->
                <td /> <!-- 우주전투기 3번째 셀 영역 (빈칸) -->
                <td /> <!-- 우주전투기 4번째 셀 영역 (빈칸) -->
                <td /> <!-- 우주전투기 5번째 셀 영역 (빈칸) -->
                <td /> <!-- 우주전투기 6번째 셀 영역 (빈칸) -->
                <td /> <!-- 우주전투기 7번째 셀 영역 (빈칸) -->
              </tr>

              <!-- 스푸키펀하우스 -->
              <tr>
                <th>스푸키펀하우스</th> <!-- 시설명 : 스푸키펀하우스 -->
                <td /> <!-- 스푸키펀하우스 1번째 셀 영역 (빈칸) -->
                <td /> <!-- 스푸키펀하우스 2번째 셀 영역 (빈칸) -->
                <td /> <!-- 스푸키펀하우스 3번째 셀 영역 (빈칸) -->
                <td /> <!-- 스푸키펀하우스 4번째 셀 영역 (빈칸) -->

                <!-- 스푸키펀하우스 5,6,7번째 셀 영역 ([일부 변경] 10:00 ~ 20:00) -->
                <td
                  colspan="3"
                >
                  <div class="bg-warning">
                    <div>[일부 변경] 10:00 ~ 20:00</div>
                  </div>
                </td>
              </tr>

              <!-- 비룡열차 -->
              <tr>
                <th>비룡열차</th> <!-- 시설명 : 비룡열차 -->
                <td /> <!-- 비룡열차 1번째 셀 영역 (빈칸) -->
                <td /> <!-- 비룡열차 2번째 셀 영역 (빈칸) -->
                <td /> <!-- 비룡열차 3번째 셀 영역 (빈칸) -->
                <td /> <!-- 비룡열차 4번째 셀 영역 (빈칸) -->
                <td /> <!-- 비룡열차 5번째 셀 영역 (빈칸) -->
                <td /> <!-- 비룡열차 6번째 셀 영역 (빈칸) -->
                <td /> <!-- 비룡열차 7번째 셀 영역 (빈칸) -->
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 03 (굵은 선 기준으로 나눔)-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 04 (굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- 썬더폴스 -->
              <tr>
                <th>썬더폴스</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 매직쿠키하우스 -->
              <tr>
                <th>매직쿠키하우스</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <!-- 매직쿠키하우스 7번째 셀 영역([오전 점검] 13:00 ~)-->
                <td>
                  <div class="bg-danger">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>
              </tr>

              <!-- 매직스윙 -->
              <tr>
                <th>매직스윙</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 플래쉬팡팡 -->
              <tr>
                <th>플래쉬팡팡</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <!-- 플래쉬팡팡 6번째 셀 영역 ([오전 점검] 13:00 ~)-->
                <td>
                  <div class="bg-danger">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>
                <td />
              </tr>

              <!-- 피터팬 -->
              <tr>
                <th>피터팬</th>
                <td />
                <td />
                <td />
                <!-- 피터팬 4번째 셀 영역 ([오전 점검] 13:00 ~)-->
                <td>
                  <div class="bg-danger">
                    <div>[오전 점검] 13:00 ~</div>
                  </div>
                </td>
                <td />
                <td />
                <td />
              </tr>

              <!-- 붕붕카 -->
              <tr>
                <th>붕붕카</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 나는코끼리 -->
              <tr>
                <th>나는코끼리</th>
                <!-- 나는코끼리 1,2,3,4,5,6,7번째 셀 영역([일부 변경] 10:00 ~ 18:00)-->
                <td
                  colspan="7"
                >
                  <div class="bg-danger">
                    <div>[일부 변경] 10:00 ~ 18:00</div>
                  </div>
                </td>
              </tr>

              <!-- 스카이댄싱 -->
              <tr>
                <th>스카이댄싱</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 로얄쥬빌리캐로셀 -->
              <tr>
                <th>로얄쥬빌리캐로셀</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 페스티벌트레인 -->
              <tr>
                <th>페스티벌트레인</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 로보트카 -->
              <tr>
                <th>로보트카</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 04 (굵은 선 기준으로 나눔)-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 05 (굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- T익스프레스 -->
              <tr>
                <th>T익스프레스</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 아마존익스프레스 -->
              <tr>
                <th>아마존익스프레스</th>
                <td />
                <!-- 아마존익스프레스 2,3번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="2"
                >
                  <div class="bg-success-01">
                    <div>[일부 변경] 10:30 ~ 20:00</div>
                  </div>
                </td>
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 레니의마법학교 -->
              <tr>
                <th>레니의마법학교</th>
                <td />
                <!-- 레니의마법학교 2,3번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="2"
                >
                  <div class="bg-success-01">
                    <div>[일부 변경] 10:30 ~ 20:00</div>
                  </div>
                </td>
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 스페이스 투어 -->
              <tr>
                <th>스페이스투어</th>
                <td />
                <!-- 스페이스투어 2,3번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="2"
                >
                  <div class="bg-success-01">
                    <div>[일부 변경] 10:30 ~ 20:00</div>
                  </div>
                </td>
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 슈팅고스트 -->
              <tr>
                <th>슈팅고스트</th>
                <td />
                <!-- 슈팅고스트 2,3번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="2"
                >
                  <div class="bg-success-01">
                    <div>[일부 변경] 10:30 ~ 20:00</div>
                  </div>
                </td>
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 호러메이즈 -->
              <tr>
                <th>호러메이즈</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 05 (굵은 선 기준으로 나눔)-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 06 (굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- 로스트밸리 -->
              <tr>
                <th>로스트밸리</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <!-- 로스트밸리 6,7번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="2"
                >
                  <div class="bg-success-02">
                    <div>[일부 변경] 10:30 ~ 20:00</div>
                  </div>
                </td>
              </tr>

              <!-- 사파리월드 -->
              <tr>
                <th>사파리월드</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <!-- 사파리월드 6,7번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="2"
                >
                  <div class="bg-success-02">
                    <div>[일부 변경] 10:30 ~ 20:00</div>
                  </div>
                </td>
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 06 (굵은 선 기준으로 나눔)-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 07 (굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- 스카이웨이 -->
              <tr>
                <th>스키이웨이</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 휴먼스카이 -->
              <tr>
                <th>휴먼스카이</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 스카이크루즈 -->
              <tr>
                <th>스키이크루즈</th>
                <td />
                <td />
                <!-- 스키이크루즈 3,4,5,6,7번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="5"
                >
                  <div class="bg-pink">
                    <div>[운휴]</div>
                  </div>
                </td>
              </tr>

              <!-- 동물원무빙웨이 -->
              <tr>
                <th>동물원무빙웨이</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 07 (굵은 선 기준으로 나눔)-->


            <!-- S :: 일별 시설 운영 정보 테이블 데이터 영역 08 (굵은 선 기준으로 나눔)-->
            <tbody>
              <!-- 쥬빌리 게임즈 -->
              <tr>
                <th>쥬빌리 게임즈</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 게임어드벤처 -->
              <tr>
                <th>게임어드벤처</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>

              <!-- 게임피아 -->
              <tr>
                <th>게임피아</th>
                <!-- 게임피아 1,2,3,4,5번째 셀 영역 ([일부 변경] 10:30 ~ 20:00)-->
                <td
                  colspan="5"
                >
                  <div class="bg-primary-02">
                    <div>[운휴]</div>
                  </div>
                </td>
                <td />
                <td />
              </tr>

              <!-- 알파인게임장 -->
              <tr>
                <th>알파인게임장</th>
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
                <td />
              </tr>
            </tbody>
            <!-- E :: 일별 시설 운영 정보 테이블 데이터 영역 08 (굵은 선 기준으로 나눔)-->
          </table>
        </ur-tab-content>
        <ur-tab-content
          idx="2"
          label="캐리비안베이"
        >
          <h4>캐리비안베이</h4>
        </ur-tab-content>
      </ur-tab-box>
    </sui-page-contents>
  </sui-page>
</template>
<script>

export default {
  name: 'PGE_AAZ_00013', // eslint-disable-line vue/name-property-casing
  components: {

  },
  data() {
    return {

      // 일별 시설 운영 통계 테이블 옵션
      opts1: {
        height: 233,
        pagination: true,
        noInfo: true,
        multiSelect: false,
        selectCheck: false,
        styleBordered: true,
      },

      // 일별 시설 운영 통계 테이블
      columns01: [
        {
          text: '구분',
          value: 'value1',
          width: 170,
          headerAlign: 'center',
        },
        {
          text: '일 11.20',
          value: 'value2',
          headerAlign: 'center',
        },
        {
          text: '월 11.21',
          value: 'value3',
          headerAlign: 'center',
        },
        {
          text: '화 11.22',
          value: 'value4',
          headerAlign: 'center',
        },
        {
          text: '수 11.23',
          value: 'value5',
          headerAlign: 'center',
        },
        {
          text: '목 11.24',
          value: 'value6',
          headerAlign: 'center',
        },
        {
          text: '금 11.25',
          value: 'value7',
          headerAlign: 'center',
        },
        {
          text: '토 11.26',
          value: 'value8',
          headerAlign: 'center',
        },
      ],

      // 일별 시설 운영 통계 DATA
      list01: [
        {
          value1: '[PM 점검]', value2: '0', value3: '0', value4: '0', value5: '2', value6: '2', value7: '2', value8: '2',
        },
        {
          value1: '동계/공사/대관 운휴', value2: '1', value3: '1', value4: '1', value5: '1', value6: '1', value7: '1', value8: '1',
        },
        {
          value1: 'CLOSED', value2: '3', value3: '3', value4: '3', value5: '3', value6: '3', value7: '3', value8: '3',
        },
        {
          value1: '가동 率', value2: '89.5%', value3: '89.5%', value4: '89.5%', value5: '84.2%', value6: '84.2%', value7: '84.2%', value8: '84.2%',
        },
      ],
    }
  },
  computed: {
    // 계산된 속성, date pickproperty로 사용가능

  },

  watch: {
    // data 변경시 특정 함수를 호출 해야 하는 경우(async 등)

  },
  created() {

  },
  mounted() { },
  methods: {

  },
}


</script>
<style scoped>
</style>
